In [53]:
import pandas as pd

In [59]:
results_df = pd.read_excel('RESULTS_MATH_161.xlsx')
results_df.head()

,First name,Last name,ID number,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
0,David Kwadwo Frimpong,ABABIO,21098429,5.0,3.0,8.0,7.0,16.0,39,16.714286
1,Wendy Atampoka,ABAGNA,21102596,7.0,5.0,8.0,NaN,7.0,27,11.571429
2,Joshua,ABAKAH,21108632,7.0,8.0,9.0,10.0,9.0,43,18.428571
3,Samuel Kwaku,ABANKWA,21108576,6.0,8.0,8.0,6.0,14.0,42,18.000000
4,Joseph,ABBAN,21163755,9.0,5.0,8.0,7.0,17.0,46,19.714286

In [67]:
results_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 669 entries, 21098429 to 21173879
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First name  669 non-null    object
 1   Last name   669 non-null    object
 2   Q1_10       558 non-null    float64
 3   Q2_10       621 non-null    float64
 4   Q3_10       619 non-null    float64
 5   Q4_10       586 non-null    float64
 6   MS_30       661 non-null    float64
 7   T_70        669 non-null    int64
 8   CA_30       669 non-null    float64
dtypes: float64(6), int64(1), object(2)
memory usage: 52.3+ KB

In [71]:
results_df = results_df.set_index('ID number')
results_df.describe()

,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
count,558.000000,621.000000,619.000000,586.000000,661.000000,669.000000,669.000000
mean,6.075269,5.333333,6.316640,6.982935,13.544629,35.361734,15.155029
std,2.115531,2.293047,1.659502,2.356235,5.579173,10.517341,4.507432
min,0.000000,0.000000,0.000000,0.000000,2.000000,0.000000,0.000000
25%,5.000000,3.000000,5.000000,6.000000,9.000000,29.000000,12.428571
50%,6.000000,5.000000,7.000000,7.000000,13.000000,36.000000,15.428571
75%,8.000000,7.000000,8.000000,9.000000,17.000000,43.000000,18.428571
max,10.000000,10.000000,10.000000,10.000000,29.000000,61.000000,26.142857

In [72]:
results_df.isnull().sum().sort_values(ascending=False)

Q1_10         111
Q4_10          83
Q3_10          50
Q2_10          48
MS_30           8
First name      0
Last name       0
T_70            0
CA_30           0
dtype: int64

In [73]:
tests = ['Q1_10', 'Q2_10', 'Q3_10', 'Q4_10', 'MS_30', 'T_70', 'CA_30']
outliers = {}

for col in tests:
    Q1 = results_df[col].quantile(0.25)
    Q3 = results_df[col].quantile(0.75)
    IQR = Q3 - Q1

    lower = Q1 - (1.5 * IQR)
    upper = Q3 + (1.5 * IQR)

    outliers[col] = results_df[(results_df[col] < lower) | (results_df[col] > upper)]

In [81]:
outliers['Q1_10']

,First name,Last name,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
ID number,,,,,,,,,
21114429,Aaron Offei,DARKO,0.0,NaN,8.0,2.0,13.0,23,9.857143
21128414,Benedict Kwame,KARIKARI,0.0,5.0,7.0,9.0,13.0,34,14.571429
21136038,Herman Nayram,LUMOR,0.0,5.0,5.0,9.0,13.0,32,13.714286
21075010,Shedal,MOHAMMED,0.0,5.0,7.0,7.0,6.0,25,10.714286
21183678,Abdul Malik,RAZAK,0.0,7.0,6.0,NaN,17.0,30,12.857143

In [82]:
outliers['Q2_10']

Empty DataFrame
Columns: [First name, Last name, Q1_10, Q2_10, Q3_10, Q4_10, MS_30, T_70, CA_30]
Index: []

In [83]:
outliers['Q3_10']

,First name,Last name,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
ID number,,,,,,,,,
21169894,Kwadwo Acheampong,BOATENG,6.0,1.0,0.0,2.0,13.0,22,9.428571

In [84]:
outliers['Q4_10']

,First name,Last name,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
ID number,,,,,,,,,
21167281,Davis Cadwell,ADJEI,9.0,5.0,8.0,0.0,14.0,36,15.428571
21100257,Douglas,ADJEI,5.0,7.0,8.0,0.0,10.0,30,12.857143
21090783,Michael,AFFUM,6.0,2.0,1.0,0.0,14.0,23,9.857143
21184405,Emmanuel Obeng,AGYAPONG,NaN,2.0,1.0,0.0,5.0,8,3.428571
21072177,Benjamin Adotey,ALLOTEY,5.0,7.0,5.0,0.0,11.0,28,12.000000
21183885,Gideon,ANAMAN,3.0,1.0,2.0,1.0,7.0,14,6.000000
21138722,Lawrence Mawuli,AYIM,5.0,5.0,5.0,1.0,19.0,35,15.000000
21146527,Orleans Kojo,BARNES,9.0,5.0,5.0,1.0,23.0,43,18.428571
21082041,Nana Owusu,BOATENG,8.0,2.0,1.0,1.0,15.0,27,11.571429
21106892,Sylvester Kwabena,DAPAAH,5.0,7.0,8.0,0.0,11.0,31,13.285714
21184378,Morris Adu-Baah,EDUAH,6.0,5.0,6.0,1.0,15.0,33,14.142857
21133250,Giovanni,KAKU-ACKAH,4.0,4.0,2.0,1.0,15.0,26,11.142857
21139582,Adnan,KASSIM,7.0,3.0,7.0,1.0,10.0,28,12.000000
21083066,Grace Onyinah Adwapah,OPOKU,6.0,3.0,5.0,1.0,14.0,29,12.428571

In [90]:
outliers['MS_30']

Empty DataFrame
Columns: [First name, Last name, Q1_10, Q2_10, Q3_10, Q4_10, MS_30, T_70, CA_30]
Index: []

In [91]:
outliers['T_70']

,First name,Last name,Q1_10,Q2_10,Q3_10,Q4_10,MS_30,T_70,CA_30
ID number,,,,,,,,,
20763265,Kassim,ABDULAI,NaN,NaN,NaN,NaN,NaN,0,0.000000
21017923,Emmanuel Nsorbila,ADOMBIRE,NaN,NaN,NaN,NaN,NaN,0,0.000000
21079415,Caroline Aba,AIDOO,NaN,NaN,NaN,NaN,NaN,0,0.000000
21019205,Denzel Boateng,ASANTE,NaN,NaN,NaN,NaN,4.0,4,1.714286
21085320,Annabel,NTOSO,NaN,NaN,NaN,NaN,4.0,4,1.714286
21101945,Emmanuel,OSEI,NaN,NaN,NaN,NaN,NaN,0,0.000000
21137713,Keren Boadiwaa,PUMPUNI,7.0,NaN,NaN,NaN,NaN,7,3.000000
21105482,Selma,TAMIMU,6.0,NaN,NaN,NaN,NaN,6,2.571429